privronQweekle/CH559sdccUSBHost/USBHost.c
void resetHubDevices(unsigned char hubindex)
{
	 __xdata unsigned char hiddevice;
    VendorProductID[hubindex].idVendorL = 0;
    VendorProductID[hubindex].idVendorH = 0;
    VendorProductID[hubindex].idProductL = 0;
    VendorProductID[hubindex].idProductH = 0;
	for (hiddevice = 0; hiddevice < MAX_HID_DEVICES; hiddevice++)
	{
	if(HIDdevice[hiddevice].rootHub == hubindex){
	HIDdevice[hiddevice].connected  = 0;
	HIDdevice[hiddevice].rootHub  = 0;
	HIDdevice[hiddevice].interface  = 0;
	HIDdevice[hiddevice].endPoint  = 0;
	HIDdevice[hiddevice].type  = 0;
	}
	}
	CDCdevice[hubindex].connected = 0;
	CDCdevice[hubindex].commInterface = 0;
	CDCdevice[hubindex].endPoint = 0;
}

void pollHIDdevice()
{
	 __xdata unsigned char s, hiddevice, len;
	for (hiddevice = 0; hiddevice < MAX_HID_DEVICES; hiddevice++)
	{
		if(HIDdevice[hiddevice].connected){
		selectHubPort(HIDdevice[hiddevice].rootHub, 0);
		s = hostTransfer( USB_PID_IN << 4 | HIDdevice[hiddevice].endPoint & 0x7F, HIDdevice[hiddevice].endPoint & 0x80 ? bUH_R_TOG | bUH_T_TOG : 0, 0 );
		if ( s == ERR_SUCCESS )
   		{
    		HIDdevice[hiddevice].endPoint ^= 0x80;
			len = USB_RX_LEN;
			if ( len )
			{		
				LED = !LED;	
				//DEBUG_OUT("HID %lu, %i data %i : ", HIDdevice[hiddevice].type, hiddevice, HIDdevice[hiddevice].endPoint & 0x7F);
				sendHidPollMSG(MSG_TYPE_DEVICE_POLL,len, HIDdevice[hiddevice].type, hiddevice, HIDdevice[hiddevice].endPoint & 0x7F, RxBuffer,VendorProductID[HIDdevice[hiddevice].rootHub].idVendorL,VendorProductID[HIDdevice[hiddevice].rootHub].idVendorH,VendorProductID[HIDdevice[hiddevice].rootHub].idProductL,VendorProductID[HIDdevice[hiddevice].rootHub].idProductH);
			}
		}
		}
	}
}


// SET_LINE_CODING needs an OUT data stage, which hostCtrlTransfer does not
// support (its write path never copies the payload into TxBuffer). Run the
// three stages manually: SETUP (DATA0), DATA OUT (DATA1), STATUS IN (DATA1).
unsigned char cdcSetLineCoding(unsigned char commInterface)
{
	unsigned char s, i;
	fillTxBuffer(SetCDCLineCodingRequest, sizeof(SetCDCLineCodingRequest));
	((PXUSB_SETUP_REQ)TxBuffer)->wIndexL = commInterface;
	UH_TX_LEN = sizeof(USB_SETUP_REQ);
	s = hostTransfer((unsigned char)(USB_PID_SETUP << 4), 0, 10000);
	if (s != ERR_SUCCESS)
		return s;
	for (i = 0; i < sizeof(CDCLineCoding115200); i++)
		TxBuffer[i] = CDCLineCoding115200[i];
	UH_TX_LEN = sizeof(CDCLineCoding115200);
	s = hostTransfer((unsigned char)(USB_PID_OUT << 4), bUH_R_TOG | bUH_T_TOG, 10000);
	if (s != ERR_SUCCESS)
		return s;
	UH_TX_LEN = 0;
	return hostTransfer((unsigned char)(USB_PID_IN << 4), bUH_R_TOG | bUH_T_TOG, 10000);
}

unsigned char cdcInitDevice(unsigned char rootHubIndex)
{
	unsigned char s;
	s = cdcSetLineCoding(CDCdevice[rootHubIndex].commInterface);
	DEBUG_OUT("CDC SET_LINE_CODING: %02X\n", s);
	// Line coding is informational for pure-USB devices; don't fail on it.
	fillTxBuffer(SetCDCControlLineStateRequest, sizeof(SetCDCControlLineStateRequest));
	((PXUSB_SETUP_REQ)TxBuffer)->wIndexL = CDCdevice[rootHubIndex].commInterface;
	s = hostCtrlTransfer(0, 0, 0);
	DEBUG_OUT("CDC SET_CONTROL_LINE_STATE: %02X\n", s);
	return s;
}

void pollCDCdevice()
{
	__xdata unsigned char s, hub, len;
	for (hub = 0; hub < ROOT_HUB_COUNT; hub++)
	{
		if (!CDCdevice[hub].connected)
			continue;
		selectHubPort(hub, 0);
		s = hostTransfer( USB_PID_IN << 4 | CDCdevice[hub].endPoint & 0x7F, CDCdevice[hub].endPoint & 0x80 ? bUH_R_TOG | bUH_T_TOG : 0, 0 );
		if (s == ERR_SUCCESS)
		{
			CDCdevice[hub].endPoint ^= 0x80;
			len = USB_RX_LEN;
			if (len)
			{
				LED = !LED;
				sendProtocolMSG(MSG_TYPE_CDC_DATA, len, 0x00, hub + 1, CDCdevice[hub].endPoint & 0x7F, RxBuffer);
			}
		}
	}
}

void parseHIDDeviceReport(unsigned char __xdata *report, unsigned short length, unsigned char CurrentDevive)
{
	unsigned short i = 0;
	unsigned char level = 0;
	unsigned char isUsageSet = 0;
	while(i < length)
	{
		unsigned char j;
		unsigned char id = report[i] & 0b11111100;
		unsigned char size = report[i] & 0b00000011;
		unsigned long data = 0;
		if(size == 3) size++;
		for(j = 0; j < size; j++)
			data |= ((unsigned long)report[i + 1 + j]) << (j * 8);
		for(j = 0; j < level - (id == REPORT_COLLECTION_END ? 1 : 0); j++)
			DEBUG_OUT("    ");
		switch(id)
		{
			case REPORT_USAGE_PAGE:	//todo clean up defines (case)
			{
				unsigned long vd = data < REPORT_USAGE_PAGE_VENDOR ? data : REPORT_USAGE_PAGE_VENDOR;
				DEBUG_OUT("Usage page ");
				switch(vd)
				{
					case REPORT_USAGE_PAGE_LEDS:
						DEBUG_OUT("LEDs");
					break;
					case REPORT_USAGE_PAGE_KEYBOARD:
						DEBUG_OUT("Keyboard/Keypad");
					break;
					case REPORT_USAGE_PAGE_BUTTON:
						DEBUG_OUT("Button");
					break;
					case REPORT_USAGE_PAGE_GENERIC:
						DEBUG_OUT("generic desktop controls");
					break;
					case REPORT_USAGE_PAGE_VENDOR:
						DEBUG_OUT("vendor defined 0x%04lx", data);
					break;
					default:
						DEBUG_OUT("unknown 0x%02lx", data);
				}
				DEBUG_OUT("\n");
			}
			break;
			case REPORT_USAGE:
				if (!isUsageSet){
					HIDdevice[CurrentDevive].type = data;
					isUsageSet = 1;
				}
				DEBUG_OUT("Usage ");
				switch(data)
				{
					case REPORT_USAGE_UNKNOWN:
						DEBUG_OUT("Unknown");
					break;
					case REPORT_USAGE_POINTER:
						DEBUG_OUT("Pointer");
					break;
					case REPORT_USAGE_MOUSE:
						DEBUG_OUT("Mouse");
					break;
					case REPORT_USAGE_RESERVED:
						DEBUG_OUT("Reserved");
					break;
					case REPORT_USAGE_JOYSTICK:
						DEBUG_OUT("Joystick");
					break;
					case REPORT_USAGE_GAMEPAD:
						DEBUG_OUT("Gamepad");
					break;
					case REPORT_USAGE_KEYBOARD:
						DEBUG_OUT("Keyboard");
					break;
					case REPORT_USAGE_KEYPAD:
						DEBUG_OUT("Keypad");
					break;
					case REPORT_USAGE_MULTI_AXIS:
						DEBUG_OUT("Multi-Axis controller");
					break;
					case REPORT_USAGE_SYSTEM:
						DEBUG_OUT("Tablet system controls");
					break;

